&Пластилин Перем ПрикладнойВебСервер;

&Контроллер("/v1")
Процедура ПриСозданииОбъекта()

КонецПроцедуры

&ТочкаМаршрута("my_secret_store/super_secret")
Процедура ДанныеVault(ТелоЗапросОбъект, Ответ) Экспорт

	ТестовыйОтвет = "{
	|   ""data"" : {
	|		""owner"" : {
	|			""contact"" : {
	|				""email"" : """",
	|				""tel"" : ""77777777""
	|			},
	|			""person"" : {
	|				""address"" : ""Alpha Centauri""
	|			}
	|		},
	|		""admin"" : {
	|			""contact"" : {
	|				""email"" : ""admin.ru"",
	|			}
	|		}
	| 	}
	|}";

	Ответ.УстановитьТипКонтента("json");
	Ответ.ТелоТекст = ТестовыйОтвет;
КонецПроцедуры

&ТочкаМаршрута("kill")
Процедура ЗавершениеРаботы(ТелоЗапросОбъект, Ответ) Экспорт
	ПрикладнойВебСервер.Стоп();
КонецПроцедуры
