#использовать "../src/"
#Использовать asserts

&Тест
Процедура ПроверитьПолучениеПеременныхСредыБезПрефикса() Экспорт

	// Дано

	УстановитьПеременнуюСреды("Test__Configor_Env", "ТестЗначение", РасположениеПеременнойСреды.Процесс);

	// Когда

	МенеджерПараметров = Новый МенеджерПараметров();

	МенеджерПараметров.ДобавитьПровайдерПараметров(Новый ПровайдерПараметровENV());

	МенеджерПараметров.Прочитать();

	// Тогда

	Ожидаем.Что(МенеджерПараметров.Параметр("Test_Configor.Env")).Равно("ТестЗначение");

КонецПроцедуры

&Тест
Процедура ПроверитьПолучениеПеременныхСредыСПрефиксом() Экспорт

	// Дано

	УстановитьПеременнуюСреды("Test_Configor__Env", "ТестЗначение", РасположениеПеременнойСреды.Процесс);

	// Когда

	МенеджерПараметров = Новый МенеджерПараметров();

	МенеджерПараметров.ДобавитьПровайдерПараметров(Новый ПровайдерПараметровENV("Test."));

	МенеджерПараметров.Прочитать();

	// Тогда

	Ожидаем.Что(МенеджерПараметров.Параметр("Configor_Env")).Равно("ТестЗначение");

КонецПроцедуры
