#использовать "../src/"
#Использовать asserts

&Тест
Процедура ПроверитьПолучениеПеременныхСредыБезПрефикса() Экспорт

	// Дано

	УстановитьПеременнуюСреды("TestConfigorEnv", "ТестЗначение", РасположениеПеременнойСреды.Процесс);

	// Когда

	МенеджерПараметров = Новый МенеджерПараметров();

	МенеджерПараметров.ДобавитьПровайдерПараметров(Новый ПровайдерПараметровENV());

	МенеджерПараметров.Прочитать();

	// Тогда

	Ожидаем.Что(МенеджерПараметров.Параметр("TestConfigorEnv")).Равно("ТестЗначение");

КонецПроцедуры

&Тест
Процедура ПроверитьПолучениеПеременныхСредыСПрефиксом() Экспорт

	// Дано

	УстановитьПеременнуюСреды("Test_ConfigorEnv", "ТестЗначение", РасположениеПеременнойСреды.Процесс);

	// Когда

	МенеджерПараметров = Новый МенеджерПараметров();

	МенеджерПараметров.ДобавитьПровайдерПараметров(Новый ПровайдерПараметровENV("Test_"));

	МенеджерПараметров.Прочитать();

	// Тогда

	Ожидаем.Что(МенеджерПараметров.Параметр("ConfigorEnv")).Равно("ТестЗначение");

КонецПроцедуры
