#использовать "../src/"
#Использовать asserts

&Тест
Процедура ПроверитьПолучениеПараметровИзСоответствия() Экспорт

	// Дано

	Массив = Новый Массив;
	Массив.Добавить(2);

	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Тест1", 1);
	Соответствие.Вставить("Тест2", Массив);

	// Когда

	МенеджерПараметров = Новый МенеджерПараметров();

	МенеджерПараметров.ДобавитьПровайдерПараметров(Новый ПровайдерПараметровСоответствие(Соответствие));

	МенеджерПараметров.Прочитать();

	// Тогда

	Ожидаем.Что(МенеджерПараметров.Параметр("Тест1")).Равно(1);
	Ожидаем.Что(МенеджерПараметров.Параметр("Тест2")[0]).Равно(2);

КонецПроцедуры

&Тест
Процедура ПроверитьОшибкуПриПередачиДругогоИсточника() Экспорт

	БылоИсключение = Ложь;

	Попытка
		А = Новый ПровайдерПараметровСоответствие(Новый Массив);
	Исключение

		БылоИсключение = Истина;

		Ожидаем.Что(ИнформацияОбОшибке().Описание)
			.Содержит("Для провайдера параметров Соответствие, источником параметров может быть только соответствие");
	КонецПопытки;

	Ожидаем.Что(БылоИсключение).ЭтоИстина();

КонецПроцедуры
