#использовать "../src/"
#Использовать asserts
#Использовать 1connector
#Использовать 1commands

&Тест
Процедура ПроверитьПолучениеПараметровИзVault() Экспорт

	ЗапуститьТестовыйВолт();
	Приостановить(5000); // чтобы вино успело стартануть
	
	// Дано

	НастройкиVault = Новый Структура;
    НастройкиVault.Вставить("Адрес", "http://localhost:3333");
    НастройкиVault.Вставить("Токен", "VAULT_TOKEN");
    НастройкиVault.Вставить("Запрос", "v1/my_secret_store/super_secrett");

    МенеджерПараметров = Новый МенеджерПараметров();
	МенеджерПараметров.ДобавитьПровайдерПараметров(Новый ПровайдерПараметровVAULT());
	МенеджерПараметров.УстановитьНастройкиVault(НастройкиVault);

	// Когда

	МенеджерПараметров.Прочитать();

	// Тогда

	Ожидаем.Что(МенеджерПараметров.Параметр("owner.contact.email")).Равно("");
	Ожидаем.Что(МенеджерПараметров.Параметр("owner.contact.tel")).Равно("77777777");
	Ожидаем.Что(МенеджерПараметров.Параметр("owner.person.address")).Равно("Alpha Centauri");
	Ожидаем.Что(МенеджерПараметров.Параметр("admin.contact.email")).Равно("admin.ru");
	Ожидаем.Что(МенеджерПараметров.Параметр("person.address")).ЭтоНеопределено();

	УбитьТестовыйВолт(НастройкиVault["Адрес"]);

КонецПроцедуры

Функция КаталогFixtures()
	Возврат ОбъединитьПути(КаталогБиблиотеки(), "tests", "fixtures");
КонецФункции

Функция КаталогБиблиотеки()
	Возврат ОбъединитьПути(ТекущийСценарий().Каталог, "..");
КонецФункции

Функция ЗапуститьТестовыйВолт()
	
	Путь = ОбъединитьПути(КаталогFixtures(), "ТестовыйVault");

	ЗапускВина = Новый Команда;
	ЗапускВина.УстановитьСтрокуЗапуска("oscript main.os");
	ЗапускВина.УстановитьРабочийКаталог(Путь);

	Возврат ЗапускВина.ЗапуститьПроцесс();
КонецФункции

Функция УбитьТестовыйВолт(Знач Адрес)
	URL = СтрШаблон("%1/v1/kill", Адрес);
	Возврат КоннекторHTTP.Get(URL, , Новый Структура("Заголовки", Новый Соответствие));
КонецФункции
