#использовать "../src/core"
#Использовать asserts
#Использовать logos

Перем юТест;
Перем Лог;

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт

	юТест = Тестирование;

	ИменаТестов = Новый Массив;

	ИменаТестов.Добавить("ТестДолжен_ПроверитьМаксимальнаяВерсияМежду");
	// ИменаТестов.Добавить("ТестДолжен_ПроверитьПарсингОпций");
	// ИменаТестов.Добавить("ТестДолжен_ПроверитьПарсингМассивовОпций");

	Возврат ИменаТестов;

КонецФункции

Процедура ТестДолжен_ПроверитьМаксимальнаяВерсияМежду() Экспорт

	ТестовыеСлучаи = Новый Массив;
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("1.0.0 1.0.1 1.0.2", "*", "*", "1.0.2"));
	
	/////////
	// Любой символ
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("1.0.0 1.0.1 1.0.2 1.0 2.0", "1.0.Х", "*", "1.0.2"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("1.0.0 1.0.1 1.0.2 1.0 2.0", "1.*", "*", "1.0.2"));
	/////////
	// Тильда
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("1.0.0 1.0.1 1.0.2", "~1.0.2", "*", "1.0.2"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("1.0.0 1.0.1 0.0.4 0.0.3", "~0.0.2", "*", "0.0.4"));
	
	/////////
	// Каретка
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("1.0.0 1.0.1 1.2.2 0.0.2 2.0", "^1.х", "*", "1.2.2"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("1.0.0 1.0.1 1.0.2 2.0", "^1.0.2", "*", "1.0.2"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("1.0.0 1.3.1 1.2.2 0.0.2 2.0", "^1.2.х", "*", "1.3.1"));
	// Каретка меньше 0
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("1.0.0 1.0.1 0.0.4 0.0.3", "^0.х", "*", "0.0.4"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("1.0.0 1.0.1 0.0.4 0.0.3", "^0.0", "*", "0.0.4"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("1.0.0 1.0.1 0.0.4 0.0.3", "^0.0.3", "*", "0.0.3"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("1.0.0 1.0.1 1.0.2 0.0.2 2.0", "^0.0.х", "*", "0.0.2"));
	
	/////////////////////
	//  Ограничение с 2-х сторон
	
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("1.0.0 1.0.1 1.0.2 1.0 2.0", ">=1.0.0", "<2.0", "1.0.2"));
	ТестовыеСлучаи.Добавить(ТестовыйСлучай("1.0.0 1.0.1 1.1.2 1.1 2.0", ">=1.0.0", "1.х", "1.1.2"));
	
	// ТестовыеСлучаи.Добавить(ТестовыйСлучай("1.0.0 1.0.1 1.0.2", "*", "*", Истина));
	// ТестовыеСлучаи.Добавить(ТестовыйСлучай("1.0.0 1.0.1 1.0.2", "*", "*", Истина));
	// ТестовыеСлучаи.Добавить(ТестовыйСлучай("1.0.0 1.0.1 1.0.2", "*", "*", Истина));
	// ТестовыеСлучаи.Добавить(ТестовыйСлучай("1.0.0 1.0.1 1.0.2", "*", "*", Истина));

	Для каждого Тест Из ТестовыеСлучаи Цикл
		Лог.Отладка("Проверяю тестовый случай: %1", СтрСоединить(Тест.ВерсииПроверки, " "));
		Лог.Отладка("Ограничение сверху: %1", Тест.ВерхнийДиапазон);
		Лог.Отладка("Ограничение снизу: %1", Тест.НижнийДиапазон);

		ИтоговаяВерсия = Версии.МаксимальнаяВерсияМежду(Тест.ВерсииПроверки, Тест.НижнийДиапазон, Тест.ВерхнийДиапазон);

		Утверждения.ПроверитьРавенство(ИтоговаяВерсия.ВСтроку(), Тест.Результат, "Результат должен совпадать с ожиданиями.");

	КонецЦикла

КонецПроцедуры

Функция ТестовыйСлучай(Знач ВерсииПроверки, Знач НижнийДиапазон, Знач ВерхнийДиапазон, Знач Результат)

	Тест = Новый Структура;
	Тест.Вставить("ВерсииПроверки",СтрРазделить(ВерсииПроверки, " "));
	Тест.Вставить("НижнийДиапазон",НижнийДиапазон);
	Тест.Вставить("ВерхнийДиапазон",ВерхнийДиапазон);
	Тест.Вставить("Результат",Результат);

	Возврат Тест;
КонецФункции

Лог = Логирование.ПолучитьЛог("oscript.lib.semver");
//Лог.УстановитьУровень(УровниЛога.Отладка);