Перем мПараметры;

Функция Параметры() Экспорт
	Возврат мПараметры;
КонецФункции

Процедура УстановитьПараметры(Знач ВходящиеПараметры) Экспорт
	мПараметры = ВходящиеПараметры;
КонецПроцедуры

Процедура ОписаниеПараметров(Знач Конструктор) Экспорт
	
	ПараметрСоответствиеСтруктуры = Конструктор.НовыеПараметры()
				.ПолеСтрока("КлючВнутри1")
				.ПолеСтрока("КлючВнутри2")
				;
	
	ПараметрСтруктураВнутри = Конструктор.НовыеПараметры()
				.ПолеСтрока("Ключ1")
				.ПолеСтрока("Ключ2")
				;
	ПараметрСоответствие = Конструктор.НовыеПараметры()
				.ПолеСтрока("Ключ1")
				.ПолеСтрока("Ключ2")
				;
	
	ПараметрСтруктура = Конструктор.НовыеПараметры()
						.ПолеСтрока("Строка")
						.ПолеДата("Дата")
						.ПолеЧисло("Число")
						.ПолеМассив("Массив", Тип("Строка"))
						.ПолеОбъект("Структура", ПараметрСтруктураВнутри)
						.ПолеОбъект("Соответствие", ПараметрСоответствиеСтруктуры)
						;
	
	Конструктор.ПолеСтрока("version")
				.ПолеСтрока("ПараметрСтрока")
				.ПолеДата("ПараметрДата")
				.ПолеЧисло("ПараметрЧисло")
				.ПолеМассив("ПараметрМассив", Тип("Строка"))
				.ПолеОбъект("ПараметрСтруктура struct", ПараметрСтруктура)
				.ПолеОбъект("ПараметрСоответствие", ПараметрСоответствие)
				;

КонецПроцедуры
