Перем _ИмяКлассаДТО; // Строка - имя класса вложенного DTO, пустая строка если не указано

// Возвращает имя аннотации
//
// Возвращаемое значение:
//   Строка - имя аннотации
//
Функция ИмяАннотации() Экспорт
	Возврат "ВложенныйДТО";
КонецФункции

// Возвращает имя класса вложенного DTO
// Пустая строка означает, что класс не указан и объект
// должен быть создан в конструкторе владеющего класса
//
// Возвращаемое значение:
//   Строка - имя класса вложенного DTO
//
Функция ИмяКлассаДТО() Экспорт
	Возврат _ИмяКлассаДТО;
КонецФункции

&Аннотация("ВложенныйДТО")
Процедура ПриСозданииОбъекта(Значение = "") Экспорт
	_ИмяКлассаДТО = ?(Значение = Неопределено, "", Значение);
КонецПроцедуры
